#include<iostream>

using namespace std;

///////     05_02_2019Evening_1549379352


//	Proc7.Описать процедуру InvertDigits(K), меняющую порядок следования цифр целого положительного числа K на обратный
//	(K — параметр целого типа, являющийся одновременно входным и выходным). С помощью этой процедуры поменять порядок 
//	следования цифр на обратный для каждого из пяти данных целых чисел.


int main()
{

}


//	Proc8◦.Описать процедуру AddRightDigit(D, K), добавляющую к целому положительному числу K справа цифру D(D — входной 
//	параметр целого типа, лежащий в диапазоне 0–9, K — параметр целого типа, являющийся одновременно входным и выходным).
//	С помощью этой процедуры последовательно добавить к данному числу K справа данные цифры D1 и D2, выводя результат 
//	каждого добавления.



//	Proc9.Описать процедуру AddLeftDigit(D, K), добавляющую к целому положительному числу K слева цифру D(D — входной параметр
//	целого типа, лежащий в диапазоне 1–9, K — параметр целого типа, являющийся одновременно входным и выходным).С помощью этой 
//	процедуры последовательно добавить к данному числу K слева данные цифры D1 и D2, выводя результат каждого добавления.